### <p style="text-align: center;">HEADER BITS:</p>

In [3]:
%ls
%pwd

LAyer 1.ipynb            academy_awards_multi.db  jobs.db
Untitled.ipynb           factbook.db              nominations.db

u'/Users/Yasha/Desktop/DATASETS/SQLITE3 DBS/RANDOM PRACTICE'

In [ ]:
import pandas as pd
import sqlite3

---

### <p style="text-align: center;"> DB SCHEMA EXPO:</p>

In [4]:
conn_factbook = sqlite3.connect('factbook.db')
conn_nominations = sqlite3.connect('nominations.db')
conn_awards = sqlite3.connect('academy_awards_multi.db ')
conn_jobs = sqlite3.connect('jobs.db')

In [6]:
query = '''
SELECT name FROM sqlite_master
'''
pd.read_sql(query,conn_jobs)

                    name
0           recent_grads
1  ix_recent_grads_index

In [12]:
query = '''
PRAGMA TABLE_INFO(recent_grads)
'''
pd.read_sql(query,conn_jobs)[[1,2]]

                    name     type
0                  index  INTEGER
1                   Rank  INTEGER
2             Major_code  INTEGER
3                  Major     TEXT
4         Major_category     TEXT
5                  Total  INTEGER
6            Sample_size  INTEGER
7                    Men  INTEGER
8                  Women  INTEGER
9             ShareWomen     REAL
10              Employed  INTEGER
11             Full_time  INTEGER
12             Part_time  INTEGER
13  Full_time_year_round  INTEGER
14            Unemployed  INTEGER
15     Unemployment_rate     REAL
16                Median  INTEGER
17                 P25th  INTEGER
18                 P75th  INTEGER
19          College_jobs  INTEGER
20      Non_college_jobs  INTEGER
21         Low_wage_jobs  INTEGER

---

## <p style="text-align: center;"> HAND-CRAFTED QUERIES:</p>

---

### <p style="text-align: center;"> RECENT GRADS DB: </p>

In [14]:
query = '''
SELECT Major,Median,Unemployed FROM recent_grads
WHERE Median < 10000 OR Unemployed <= 1000
LIMIT 10
'''
pd.read_sql(query,conn_jobs)

                                       Major  Median  Unemployed
0                      PETROLEUM ENGINEERING  110000          37
1             MINING AND MINERAL ENGINEERING   75000          85
2                  METALLURGICAL ENGINEERING   73000          16
3  NAVAL ARCHITECTURE AND MARINE ENGINEERING   70000          40
4                        NUCLEAR ENGINEERING   65000         400
5                          ACTUARIAL SCIENCE   62000         308
6                 ASTRONOMY AND ASTROPHYSICS   62000          33
7                      AEROSPACE ENGINEERING   60000         794
8                          MATERIALS SCIENCE   60000          78
9  ENGINEERING MECHANICS PHYSICS AND SCIENCE   58000          23

---

In [15]:
query = '''
SELECT Major_category,Median,Major FROM recent_grads
ORDER BY Major ASC, Median DESC
LIMIT 20
'''
pd.read_sql(query,conn_jobs)

,Major_category,Median,Major
0,Business,45000,ACCOUNTING
1,Business,62000,ACTUARIAL SCIENCE
2,Communications & Journalism,35000,ADVERTISING AND PUBLIC RELATIONS
3,Engineering,60000,AEROSPACE ENGINEERING
4,Agriculture & Natural Resources,40000,AGRICULTURAL ECONOMICS
5,Agriculture & Natural Resources,40000,AGRICULTURE PRODUCTION AND MANAGEMENT
6,Agriculture & Natural Resources,30000,ANIMAL SCIENCES
7,Humanities & Liberal Arts,28000,ANTHROPOLOGY AND ARCHEOLOGY
8,Computers & Mathematics,45000,APPLIED MATHEMATICS
9,Engineering,54000,ARCHITECTURAL ENGINEERING
10,Engineering,40000,ARCHITECTURE
11,Humanities & Liberal Arts,35000,AREA ETHNIC AND CIVILIZATION STUDIES
12,Education,32100,ART AND MUSIC EDUCATION
13,Humanities & Liberal Arts,31000,ART HISTORY AND CRITICISM
14,Physical Sciences,62000,ASTRONOMY AND ASTROPHYSICS
15,Physical Sciences,35000,ATMOSPHERIC SCIENCES AND METEOROLOGY
16,Biology & Life Science,37400,BIOCHEMICAL SCIENCES
17,Engineering,57100,BIOLOGICAL ENGINEERING
18,Biology & Life Science,33400,BIOLOGY
19,Engineering,60000,BIOMEDICAL ENGINEERING

---

In [29]:
query = '''
SELECT Major,Total,Median,Unemployment_rate, MAJOR_CATEGORY FROM recent_grads
WHERE Major_CATEGORY != 'Engineering'
AND (Median <= 50000 OR Unemployed > .065)
ORDER BY Median DESC
LIMIT 5
'''
pd.read_sql(query,conn_jobs)

,Major,Total,Median,Unemployment_rate,Major_category
0,ACTUARIAL SCIENCE,3777,62000,0.095652,Business
1,ASTRONOMY AND ASTROPHYSICS,1792,62000,0.021167,Physical Sciences
2,COURT REPORTING,1148,54000,0.011690,Law & Public Policy
3,COMPUTER SCIENCE,128319,53000,0.063173,Computers & Mathematics
4,FOOD SCIENCE,4361,53000,0.096931,Agriculture & Natural Resources

----

In [33]:
query = '''
SELECT Major_category, AVG(Low_wage_jobs)/AVG(Total) AS share_low_wage
FROM recent_grads
GROUP BY Major_category
HAVING share_low_wage > .1
'''
pd.read_sql(query,conn_jobs)

                        Major_category  share_low_wage
0                                 Arts        0.168331
1          Communications & Journalism        0.126324
2            Humanities & Liberal Arts        0.132087
3  Industrial Arts & Consumer Services        0.115713
4                  Law & Public Policy        0.115685
5             Psychology & Social Work        0.116934
6                       Social Science        0.102233

---

In [59]:
query = '''
SELECT Major_category, 
ROUND(AVG(College_jobs)/AVG(Total),3) AS share_degree_jobs

FROM recent_grads
GROUP BY Major_category
HAVING share_degree_jobs < .3
'''
pd.read_sql(query,conn_jobs)

                        Major_category  share_degree_jobs
0      Agriculture & Natural Resources              0.248
1                                 Arts              0.265
2                             Business              0.114
3          Communications & Journalism              0.220
4            Humanities & Liberal Arts              0.270
5  Industrial Arts & Consumer Services              0.249
6                  Law & Public Policy              0.163
7                       Social Science              0.215

---

In [66]:
query = '''
SELECT TOTAL(Men) AS total_men, TOTAL(Women) AS total_women,
(Total(Men)+Total(Women)) AS People,
(Total(Men)/Total(Women)) AS Men_to_Women_Ratio
FROM recent_grads
'''
pd.read_sql(query,conn_jobs)

   total_men  total_women   People  Men_to_Women_Ratio
0    2878263      3897752  6776015            0.738442

---

### <p style="text-align: center;">USEFUL CODE-BITS REPOSITORY:</p>

conn_factbook = sqlite3.connect('factbook.db')
conn_nominations = sqlite3.connect('nominations.db')
conn_awards = sqlite3.connect('academy_awards_multi.db ')
conn_jobs = sqlite3.connect('jobs.db')

query = '''

'''
pd.read_sql(query,conn_jobs)

 <p style="text-align: center;"> centered-markdown-here </p>